app/views/api/categories/show.json.jbuilder

@category.products.each do |product|
---
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 1]]